In [5]:
"""Q1. write the program to print following pattern
    1
    1 2
    1 2 3
    1 2 3 4      """

for i in range(1,5):
    for j in range(1,i+1):
        print(j,end=" ")
    print()

1
1 2
1 2 3
1 2 3 4

In [10]:
"""Q.2 write a program to display following output
*****
****
***
**
*      """

for i in range(5,0,-1):
    for j in range(i):
        print("*",end=" ")
    print()

* * * * *
* * * *
* * *
* *
*

In [18]:
"""Q.2 accept 10 numbers from users and display their average"""

a=0
for i in range(10):
    n=int(input("Enter number"))
    a=a+n
    avg=a/10
    print("average is:",avg)

Enter number550
average is: 55.0
Enter number30
average is: 58.0
Enter number40
average is: 62.0
Enter number50
average is: 67.0
Enter number60
average is: 73.0
Enter number50
average is: 78.0
Enter number37
average is: 81.7
Enter number37
average is: 85.4
Enter number60
average is: 91.4
Enter number80
average is: 99.4

In [22]:
"""Q.3 write a program to display all numbers which are divisible bye 11 but not by 2 
      between 100 to 500"""

for i in range(100,501):
    if i%11==0 and i%2!=0:
        print(i)

121
143
165
187
209
231
253
275
297
319
341
363
385
407
429
451
473
495

In [24]:
"""Q.4 write a program to print numbers from 1 to 20 except multiple of 2 and 3."""

for i in range(1,21):
    if i%2!=0 and i%3!=0:
        print(i)

1
5
7
11
13
17
19

In [27]:
"""Q.4 write a program to display table of number accepted from user in the following format
     7*1=7
     7*2=14"""

n=int(input("enter any number:"))
for i in range(1,11):
    print(n,"*",i,"=",n*i)

enter any number:5
5 * 1 = 5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45
5 * 10 = 50

In [31]:
"""Q.5 write a program that keep on accepting number from user until user enters zero.
   display sum and average of all them"""

num=1
a=0
i=-1
while num!=0:
    num=int(input("enter the number:"))
    a=a+num
    i=i+1
print("average is:",a/i)

enter the number:30
enter the number:50
enter the number:20
enter the number:0
average is: 33.333333333333336

In [34]:
"""Q.6 write a program to print following pattern
55555
4444
333
22
1"""

for i in range(5,0,-1):
    for j in range(1,i+1):
        print(i,end=" ")
    print()

5 5 5 5 5
4 4 4 4
3 3 3
2 2
1

In [37]:
"""Q.7 write a program to accept decimal number and display its binary"""

num=int(input("enter any number:"))
l=[]
while(num):
    r=num%2
    l.append(r)
    num=num//2
for i in range (len(l)-1,-1,-1):
    print(l[i],end="")

enter any number:8
1000

In [38]:
"""Q.8 accept a number and check wheather it is palindrome or not"""

num=int(input("enter any number:"))
a=num
b=0
while(num):
    r=num%10
    b=b*10+r
    num=num//10
if a==b:
    print("Number is palindrome")
else:
    print("number is not palindrome")  #if reverse then also remain same that number 
                                        #is called palindrome

enter any number:3663
Number is palindrome

In [43]:
"""Q.9 write a program to print the following pattern
A
BC
DEF
GHIJ
KLMNO"""

l=65
for i in range(1,6):
    for j in range(1,i+1):
        print(chr(l),end="")
        l=l+1
    print()
l=65

A
BC
DEF
GHIJ
KLMNO

In [3]:
for x in range(10,20):
    if x%2==0:
        continue;
    print(x)

11
13
15
17
19

In [5]:

for x in range(4,9,2):
    print(x*10)

40
60
80

In [6]:
""" *
   **
  ***
 ****
***** """


for i in range(1,6,1):
    for j in range(i):
        print("*",end=" ")
    print()

*
* *
* * *
* * * *
* * * * *

In [8]:
for i in range(5,0,-1):
    for j in range(i):
        print("*",end=" ")
    print()

 *  *  *  *  *
 *  *  *  *
 *  *  *
 *  *
 *

In [8]:
a=[1,2,3,4,5]
b=[5,6,7,8,9]

{5}

In [3]:
a is b

False

In [4]:
for i in a:
    if i in b:
        print(True)

True

In [20]:
a=[1,2,3,4,5]
b=[6,7,8,9]
for i in a:
    if i not in b:
        pass
        
print(False)

False

In [23]:
s="leader"
d={}

for i in a:
    if i not in d:
        d[i]=1
    else:
        d[i]+=1
    
    
print(d)

{'l': 1, 'e': 2, 'a': 1, 'd': 1, 'r': 1}

In [33]:
a=10
b=20
a^b
b^a
a^b
a
b

20

In [28]:
a

10

In [29]:
b

20

In [34]:
a=10
b=20

In [35]:
c=a^b

In [36]:
c

30

In [37]:
d=b^a

In [38]:
d

30

In [39]:
e=a^b

In [40]:
e

30

In [41]:
x=10
y=20
x=x^y
y=x^y
x=x^y

In [42]:
x

20

In [43]:
y

10

In [18]:
a=[1,2,3,4,[1,2,5,6]]
c=a[0:4]
b=a[4]
sum1=0
for i in c:
    sum1=sum1+i
    
for j in b:
    sum1=sum1+j

print(sum1)

24

In [9]:
for i in :
        print(i)

TypeError: list indices must be integers or slices, not tuple

In [15]:
c

[1, 2, 3]

In [1]:
s1=set("helloworld")

In [2]:
s1

{'d', 'e', 'h', 'l', 'o', 'r', 'w'}

In [3]:
a={10,20,30}
b={20,30,40}

In [4]:
print(a|b)

{20, 40, 10, 30}

In [5]:
s=tuple(i**2 for i in range(1,11))

In [6]:
s

(1, 4, 9, 16, 25, 36, 49, 64, 81, 100)

In [1]:
a=0.1
b=0.2
print(a+b==0.3)

False

In [4]:
c=a+b

In [5]:
c==0.3

False

In [6]:
def myfun(num):
    if num%2==0:
        return True
    else:
        return False
print(myfun(4))

True

In [9]:
num=int(input("enter the number:"))

if num >=1:
    for i in range(2,num):
        if num%2==0:
            
            print("given number is not prime")
    else:
        print("number is prime")
else:
    print("number is not not prime number")

enter the number:15
number is prime

In [1]:
x,y =10,5
x,y = y+3, x-2
if x>y:
    print(x-y)
else:
    print(y-x)

0

In [2]:
def myfun(a,b,c):
    if a>b:
        if a>c:
            return a
    elif b>c:
        return b
    else:
        return c

print(myfun(10,5,2))

10

In [5]:
def mystery(s):
    if len(s)==1:
        return s
    return mystery(s[1:])+s[0]
print(mystery("python"))

nohtyp

In [6]:
a=[1,2,3]
b=a.copy()
print(a==b, a is b)

True False

In [7]:
a=5
b=7
c=a+b if a>b else b-a
print(c)

2

In [8]:
def myfun(x,y):
    if y==0:
        return 1
    else:
        return x*myfun(x,y-1)
print(myfun(2,4))

16

In [9]:
my_str="python.hub"
print(my_str[-0])

p

In [10]:
def fun(x,y):
    x=1
    y=1
    return x+y
print(fun(3,4))

2

In [11]:
a=2
def fun():
    b=3
    return a*b
print(fun())

6

In [2]:
def python():
    return python()+1
print(python)

<function python at 0x000001BF642EC040>

In [3]:
def x (val):
    val[0]=1
v=[2,3,4]
x(v)
print(v)

[1, 3, 4]

In [3]:
result =""
for i in range(1,11):
    if i %2 ==0:
        result += str(i) + " "
print(result.strip())

2 4 6 8 10

In [4]:
for i in range(1,5):
    for j in range(i):
        if i % j == 0:
            break
    else:
        print(i, end="")

ZeroDivisionError: integer division or modulo by zero

In [2]:
i=0
while i<5:
    i +=1
    if i == 3:
        continue
    print(i, end=" ")

1 2 4 5

In [3]:
numbers=[1,2,3,4,5]
result=[n for n in numbers if n %2==0]
print(result)

[2, 4]

In [1]:
x=3**1**2
print(x)

3

In [8]:
x=5**1**2

In [9]:
x

5

In [1]:
x=5
while x >0:
    x-=1
    if x == 2:
        continue
    print(x)

4
3
1
0

In [3]:
num=7
while num > 0:
    print(num, end="")
    num//=2

731

In [1]:
a="python"
b="hub"
print(a[1:]+b[1:])

ythonub

In [1]:
mylist = [3,2,1,4,5]
result = sorted(mylist)[2:]
print(result)

[3, 4, 5]

In [2]:
for i in range(1,5):
    for j in range(i):
        if i % j ==0:
            break
    else:
        print(i, end="")

ZeroDivisionError: integer division or modulo by zero

In [3]:
x= "12.0"
print(int(x)*2)

ValueError: invalid literal for int() with base 10: '12.0'

In [4]:
try: print(1)
except: print(2)
finally : print(3)

1
3

In [7]:
a= 4/5
b= 5//4
print(a*b)

0.8

In [9]:
a=100
b=5
print(a//b*a/b)

400.0

In [10]:
a=int(1)
b=float(1)
print(a==b)

True

In [11]:
import pandas as pd

In [12]:
df= pd.read_csv('weather.csv')

In [13]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [14]:
df.describe()

       temperature   humidity
count     9.000000   9.000000
mean     74.444444  57.000000
std       6.424778  22.841848
min      65.000000  26.000000
25%      68.000000  35.000000
50%      77.000000  58.000000
75%      79.000000  80.000000
max      82.000000  85.000000

In [15]:
df.shape

(9, 4)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         9 non-null      object
 1   city         9 non-null      object
 2   temperature  9 non-null      int64
 3   humidity     9 non-null      int64
dtypes: int64(2), object(2)
memory usage: 416.0+ bytes

In [17]:
df.dtypes

date           object
city           object
temperature     int64
humidity        int64
dtype: object

In [22]:
df['city'].value_counts().sum()

9

In [26]:
df['city'].unique()

array(['new york', 'mumbai', 'beijing'], dtype=object)

In [27]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [30]:
df.loc[3:5,'date':'humidity']

       date    city  temperature  humidity
3  5/1/2017  mumbai           75        80
4  5/2/2017  mumbai           78        83
5  5/3/2017  mumbai           82        85

In [31]:
df.iloc[1:5,1:3]

       city  temperature
1  new york           66
2  new york           68
3    mumbai           75
4    mumbai           78

In [32]:
d=[{'name':'payal','id':101, 'city':'latur'},
   {'name':'ABC','id':102, 'city':'pune'},
  {'name':'XYZ','id':103, 'city':'Mumbai'},
  ]

In [33]:
df1=pd.DataFrame(d)

In [34]:
df1

    name   id    city
0  payal  101   latur
1    ABC  102    pune
2    XYZ  103  Mumbai

In [35]:
list1=[(1,'amar',50000),
       (2,'vijay',60000),
       (3,'sachin',75000)
]

In [36]:
df2=pd.DataFrame(data=list1, columns=['id','name','sal'])

In [37]:
df2

   id    name    sal
0   1    amar  50000
1   2   vijay  60000
2   3  sachin  75000

In [40]:
df2.to_csv('test.csv',index=False)

In [41]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [42]:
df.head()

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83

In [43]:
df.tail()

       date     city  temperature  humidity
4  5/2/2017   mumbai           78        83
5  5/3/2017   mumbai           82        85
6  5/1/2017  beijing           80        26
7  5/2/2017  beijing           77        30
8  5/3/2017  beijing           79        35

In [44]:
df.head(2)

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58

In [45]:
df.columns

Index(['date', 'city', 'temperature', 'humidity'], dtype='object')

In [46]:
df[['city','humidity']]

       city  humidity
0  new york        56
1  new york        58
2  new york        60
3    mumbai        80
4    mumbai        83
5    mumbai        85
6   beijing        26
7   beijing        30
8   beijing        35

In [47]:
df['department']='computer science'

In [48]:
df

       date      city  temperature  humidity        department
0  5/1/2017  new york           65        56  computer science
1  5/2/2017  new york           66        58  computer science
2  5/3/2017  new york           68        60  computer science
3  5/1/2017    mumbai           75        80  computer science
4  5/2/2017    mumbai           78        83  computer science
5  5/3/2017    mumbai           82        85  computer science
6  5/1/2017   beijing           80        26  computer science
7  5/2/2017   beijing           77        30  computer science
8  5/3/2017   beijing           79        35  computer science

In [50]:
df.drop('department',axis=1)

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [51]:
df1

    name   id    city
0  payal  101   latur
1    ABC  102    pune
2    XYZ  103  Mumbai

In [53]:
df1[df1['name']!='ABC']

    name   id    city
0  payal  101   latur
2    XYZ  103  Mumbai

In [54]:
df.drop(5)

       date      city  temperature  humidity        department
0  5/1/2017  new york           65        56  computer science
1  5/2/2017  new york           66        58  computer science
2  5/3/2017  new york           68        60  computer science
3  5/1/2017    mumbai           75        80  computer science
4  5/2/2017    mumbai           78        83  computer science
6  5/1/2017   beijing           80        26  computer science
7  5/2/2017   beijing           77        30  computer science
8  5/3/2017   beijing           79        35  computer science

In [55]:
df1

    name   id    city
0  payal  101   latur
1    ABC  102    pune
2    XYZ  103  Mumbai

In [59]:
d={'name':['sakshi'],'id':[3],'city':['Delhi']}

In [60]:
df5=pd.DataFrame(d)

In [61]:
pd.concat([df1,df5],ignore_index=True)

     name   id    city
0   payal  101   latur
1     ABC  102    pune
2     XYZ  103  Mumbai
3  sakshi    3   Delhi

In [64]:
df

       date      city  temperature  humidity        department
0  5/1/2017  new york           65        56  computer science
1  5/2/2017  new york           66        58  computer science
2  5/3/2017  new york           68        60  computer science
3  5/1/2017    mumbai           75        80  computer science
4  5/2/2017    mumbai           78        83  computer science
5  5/3/2017    mumbai           82        85  computer science
6  5/1/2017   beijing           80        26  computer science
7  5/2/2017   beijing           77        30  computer science
8  5/3/2017   beijing           79        35  computer science

In [73]:
obj=df.groupby('city')

In [74]:
obj.get_group('new york')

       date      city  temperature  humidity        department
0  5/1/2017  new york           65        56  computer science
1  5/2/2017  new york           66        58  computer science
2  5/3/2017  new york           68        60  computer science

In [75]:
df1

    name   id    city
0  payal  101   latur
1    ABC  102    pune
2    XYZ  103  Mumbai

In [76]:
d=[
    {'name':'jay','sal':50000},
    {'name':'payal','sal':65000},
    {'name':'jiya','sal':75000}
]

In [77]:
df2=pd.DataFrame(d)

In [78]:
df2

    name    sal
0    jay  50000
1  payal  65000
2   jiya  75000

In [79]:
df3=pd.concat([df1,df2],ignore_index=True)

In [80]:
df3

    name     id    city      sal
0  payal  101.0   latur      NaN
1    ABC  102.0    pune      NaN
2    XYZ  103.0  Mumbai      NaN
3    jay    NaN     NaN  50000.0
4  payal    NaN     NaN  65000.0
5   jiya    NaN     NaN  75000.0

In [88]:
pd.merge(df1, df2 on = 'name', how = 'left')

SyntaxError: invalid syntax (Temp/ipykernel_14112/3001659415.py, line 1)

In [89]:
df1

    name   id    city
0  payal  101   latur
1    ABC  102    pune
2    XYZ  103  Mumbai

In [90]:
df2

    name    sal
0    jay  50000
1  payal  65000
2   jiya  75000

In [97]:
df6 = pd.merge(df1, df2, on='name', how = 'inner',indicator=True)

In [98]:
df6

    name   id   city    sal _merge
0  payal  101  latur  65000   both

In [99]:
df

       date      city  temperature  humidity        department
0  5/1/2017  new york           65        56  computer science
1  5/2/2017  new york           66        58  computer science
2  5/3/2017  new york           68        60  computer science
3  5/1/2017    mumbai           75        80  computer science
4  5/2/2017    mumbai           78        83  computer science
5  5/3/2017    mumbai           82        85  computer science
6  5/1/2017   beijing           80        26  computer science
7  5/2/2017   beijing           77        30  computer science
8  5/3/2017   beijing           79        35  computer science

In [100]:
df.isnull().sum()

date           0
city           0
temperature    0
humidity       0
department     0
dtype: int64

In [102]:
obj=df.groupby('city')

In [104]:
obj.get_group('mumbai')

       date    city  temperature  humidity        department
3  5/1/2017  mumbai           75        80  computer science
4  5/2/2017  mumbai           78        83  computer science
5  5/3/2017  mumbai           82        85  computer science

In [105]:
t1=1,2,3
a,b,c=t1
print(a)

1

In [1]:
a='python'
b=[1,2,3]
at=(a,b)
print(at[1][1:])

[2, 3]

In [5]:
l1=[[10,20,30,40],[50,60]]
temp=[i for j in l1 for i in j]
print(temp)

[10, 20, 30, 40, 50, 60]

In [6]:
numbers = [3,5,45,97,32,22,10,19,39,43]
temp=[i for i in numbers if i%2==0]
print(temp)

[32, 22, 10]

In [8]:
#find all the numbers from 1 to 1000 divisble by 7

temp=[i for i in range(1,1000) if i%7==0 ]
print(temp)

[7, 14, 21, 28, 35, 42, 49, 56, 63, 70, 77, 84, 91, 98, 105, 112, 119, 126, 133, 140, 147, 154, 161, 168, 175, 182, 189, 196, 203, 210, 217, 224, 231, 238, 245, 252, 259, 266, 273, 280, 287, 294, 301, 308, 315, 322, 329, 336, 343, 350, 357, 364, 371, 378, 385, 392, 399, 406, 413, 420, 427, 434, 441, 448, 455, 462, 469, 476, 483, 490, 497, 504, 511, 518, 525, 532, 539, 546, 553, 560, 567, 574, 581, 588, 595, 602, 609, 616, 623, 630, 637, 644, 651, 658, 665, 672, 679, 686, 693, 700, 707, 714, 721, 728, 735, 742, 749, 756, 763, 770, 777, 784, 791, 798, 805, 812, 819, 826, 833, 840, 847, 854, 861, 868, 875, 882, 889, 896, 903, 910, 917, 924, 931, 938, 945, 952, 959, 966, 973, 980, 987, 994]

In [10]:
temp=[i for i in range(0,1000) if '3' in str(i) ]
print(temp)

[3, 13, 23, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 43, 53, 63, 73, 83, 93, 103, 113, 123, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 143, 153, 163, 173, 183, 193, 203, 213, 223, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 243, 253, 263, 273, 283, 293, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 403, 413, 423, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 443, 453, 463, 473, 483, 493, 503, 513, 523, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 543, 553, 563, 573, 583, 593, 603, 613, 623, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 643, 653, 663, 673, 683, 693, 703, 713, 723, 730, 731, 732, 733, 734, 735, 736, 737, 738, 739, 743, 753, 763, 773, 783, 793, 803, 813, 823, 830, 831, 832, 833, 834, 835, 836, 837, 838, 839, 843, 853, 863, 873, 883, 893, 903, 913, 923, 930, 931, 932, 933, 934, 935, 936, 937, 938, 939, 943, 953, 963, 973, 983, 993]

In [11]:
some_string = 'the slow solid squid swam sumptuously through the slimy swamp'
spaces = [s for s in some_string if s == ' ']
print(len(spaces))

9

In [16]:
'''Create a list of all the consonants in the string "Yellow Yaks like yelling 
   and yawning and yesturday they yodled while eating yuky yams". '''
v= "Yellow Yaks like yelling and yawning and yesturday they yodled while eating yuky yams"
temp=[i for i in v if i not in 'a,e,i,o,u," " ' ]
print(temp)

['Y', 'l', 'l', 'w', 'Y', 'k', 's', 'l', 'k', 'y', 'l', 'l', 'n', 'g', 'n', 'd', 'y', 'w', 'n', 'n', 'g', 'n', 'd', 'y', 's', 't', 'r', 'd', 'y', 't', 'h', 'y', 'y', 'd', 'l', 'd', 'w', 'h', 'l', 't', 'n', 'g', 'y', 'k', 'y', 'y', 'm', 's']

In [21]:
a=[1,2,3,4]
b=[2,3,4,5]
temp=[i for i in a if i in b]
print(temp)

[2, 3, 4]

In [22]:
a=[i for i in range(1,1000) if i%8==0]
print(a)

[8, 16, 24, 32, 40, 48, 56, 64, 72, 80, 88, 96, 104, 112, 120, 128, 136, 144, 152, 160, 168, 176, 184, 192, 200, 208, 216, 224, 232, 240, 248, 256, 264, 272, 280, 288, 296, 304, 312, 320, 328, 336, 344, 352, 360, 368, 376, 384, 392, 400, 408, 416, 424, 432, 440, 448, 456, 464, 472, 480, 488, 496, 504, 512, 520, 528, 536, 544, 552, 560, 568, 576, 584, 592, 600, 608, 616, 624, 632, 640, 648, 656, 664, 672, 680, 688, 696, 704, 712, 720, 728, 736, 744, 752, 760, 768, 776, 784, 792, 800, 808, 816, 824, 832, 840, 848, 856, 864, 872, 880, 888, 896, 904, 912, 920, 928, 936, 944, 952, 960, 968, 976, 984, 992]

In [25]:
a=[i for i in range(0,1000) if '6' in str(i)]
print(a)

[6, 16, 26, 36, 46, 56, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 76, 86, 96, 106, 116, 126, 136, 146, 156, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 176, 186, 196, 206, 216, 226, 236, 246, 256, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 276, 286, 296, 306, 316, 326, 336, 346, 356, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 376, 386, 396, 406, 416, 426, 436, 446, 456, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 476, 486, 496, 506, 516, 526, 536, 546, 556, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 576, 586, 596, 600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, 706, 716, 726, 736, 746, 756, 760, 761, 762, 763, 764, 765, 766, 767, 768, 769, 776, 786, 796, 806, 816, 826, 836, 846, 856, 860, 861, 862, 863, 864, 865, 866, 867, 868, 869, 876, 886, 896, 906, 916, 926, 936, 946, 956, 960, 961, 962, 963, 964, 965, 966, 967, 968, 969, 976, 986, 996]

In [26]:
string = "Practice Problems to Drill List Comprehension in Your Head."
result=string.count(' ')
print(result)

8

In [27]:
s=[i for i in string if i==' ']
print(len(s))

8

In [32]:
s=[i for i in string if i not in 'a,e,i,o,u," ",']
print(s)

['P', 'r', 'c', 't', 'c', 'P', 'r', 'b', 'l', 'm', 's', 't', 'D', 'r', 'l', 'l', 'L', 's', 't', 'C', 'm', 'p', 'r', 'h', 'n', 's', 'n', 'n', 'Y', 'r', 'H', 'd', '.']

In [36]:
s=[i for i in string.split(' ') if len(i)<5]
print(s)

['to', 'List', 'in', 'Your']

In [41]:
#s1=string.split(' ')
s={i:len(i) for i in string.split(' ')}
print(s)

{'Practice': 8, 'Problems': 8, 'to': 2, 'Drill': 5, 'List': 4, 'Comprehension': 13, 'in': 2, 'Your': 4, 'Head.': 5}